Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/energy_and_water_services/electricity_services_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Supply Failure/Emergencies (24 hour) Tel: 1850 372 999
ga: Teip ar an Soláthar/Éigeandálacha (24 uair a chloig) Teil: 1850 372 999

source: Commission for Energy Regulation
ga: Coimisiún um Rialáil Fuinnimh
